{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.8.0", "signature": {"inputs": {"InputLayer": {"name": "inputlayer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}, "outputs": {"tf.math.tanh": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/stack/3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "3"}, {"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/stack/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/stack/2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/stack/3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/conv2d_transpose/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fcn_model/Conv1/Conv2D/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "9"}, {"size": "3"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fcn_model/Conv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Conv2/Conv2D/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Conv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputlayer", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "256"}, {"size": "256"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fcn_model/Conv1/Relu", "op": "_FusedConv2D", "input": ["inputlayer", "StatefulPartitionedCall/fcn_model/Conv1/Conv2D/ReadVariableOp", "StatefulPartitionedCall/fcn_model/Conv1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}, "padding": {"s": "U0FNRQ=="}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/fcn_model/Conv2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/fcn_model/Conv1/Relu", "StatefulPartitionedCall/fcn_model/Conv2/Conv2D/ReadVariableOp", "StatefulPartitionedCall/fcn_model/Conv2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "epsilon": {"f": 0.0}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/fcn_model/Conv2/Relu"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/fcn_model/Deconv1/Shape", "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice/stack", "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice/stack_1", "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/stack", "op": "Pack", "input": ["StatefulPartitionedCall/fcn_model/Deconv1/strided_slice", "StatefulPartitionedCall/fcn_model/Deconv1/stack/1", "StatefulPartitionedCall/fcn_model/Deconv1/stack/2", "StatefulPartitionedCall/fcn_model/Deconv1/stack/3"], "attr": {"N": {"i": "4"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/fcn_model/Deconv1/stack", "StatefulPartitionedCall/fcn_model/Deconv1/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/fcn_model/Conv2/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/fcn_model/Deconv1/conv2d_transpose", "StatefulPartitionedCall/fcn_model/Deconv1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/fcn_model/Deconv1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/fcn_model/Deconv1/Relu"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/fcn_model/Deconv2/Shape", "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice/stack", "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice/stack_1", "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice/stack_2"], "attr": {"begin_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/stack", "op": "Pack", "input": ["StatefulPartitionedCall/fcn_model/Deconv2/strided_slice", "StatefulPartitionedCall/fcn_model/Deconv2/stack/1", "StatefulPartitionedCall/fcn_model/Deconv2/stack/2", "StatefulPartitionedCall/fcn_model/Deconv2/stack/3"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "4"}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/conv2d_transpose", "op": "Conv2DBackpropInput", "input": ["StatefulPartitionedCall/fcn_model/Deconv2/stack", "StatefulPartitionedCall/fcn_model/Deconv2/conv2d_transpose/ReadVariableOp", "StatefulPartitionedCall/fcn_model/Deconv1/Relu"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/fcn_model/Deconv2/conv2d_transpose", "StatefulPartitionedCall/fcn_model/Deconv2/BiasAdd/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "StatefulPartitionedCall/fcn_model/tf.math.tanh/Tanh", "op": "Tanh", "input": ["StatefulPartitionedCall/fcn_model/Deconv2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/fcn_model/tf.math.tanh/Tanh"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/conv2d_transpose/ReadVariableOp", "shape": [9, 9, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/stack/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/stack/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/stack/3", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/conv2d_transpose/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fcn_model/Conv1/Conv2D/ReadVariableOp", "shape": [9, 9, 3, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fcn_model/Conv1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fcn_model/Conv2/Conv2D/ReadVariableOp", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fcn_model/Conv2/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv1/BiasAdd/ReadVariableOp", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/fcn_model/Deconv2/BiasAdd/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}